#include <iostream>

using namespace std;

int main(){
    int numbers[5]; // 5 тоо авах боломжтой numbers гэх хүснэгт зарлаж байна.
    int *p; // р гэх pointer утга зарлаж байна.

    p = numbers; *p = 10; // р-ийн утгад numbers хүснэгтийг оноож өгөн, эхний *p заагч 4 byte-д 10 гэсэн утгыг өгч байна.

    p++; *p = 20; // р заагчийг нэг нэгээр нэмэгдүүлэх буюу дараачийн 4 байт хаяганд зааж өгч байна. Мөн тухайн зааж өгсөн дараагийн 4 байт хаяганд 20 гэсэн утгыг өгч байна.

    p = &numbers[2];  *p = 30; // р-ийн утгад numbers хүснэгтийн 3 дахь утгыг зааж өгнө. Дараа нь тэр заасан хувьсагчдаа 30-ийг оноож өгсөн.

    p = numbers + 3;  *p = 40; // p-ийн утгыг 3 аар нэмэгдүүлж, 4 дэх элементрүү шилжүүлж байна. Дараа нь тэр утгад 40-ийг оноож өгч байна.

    p = numbers;  *(p+4) = 50; // р-д numbers буюу хүснэгтийн хамгийн эхний хаягийг зааж өгч байна. Дараа нь хүснэгтийн 4 дэх элементийн хаягруу 50 гэсэн утга өгч байна. Өөрөөр хэлбэл numbers[4] = 50 гэсэн үг.


    for (int n=0; n<5; n++)
        cout << numbers[n] << ", ";
    /*  
        numbers хүснэгтэд хадгалагдсан тоонуудыг нөхцөлд давталт ашиглан хэвлэж байна. Мөн хэвлэхдээ ард нь таслалтайгаар хэвлэж байна.
    */
}