#include <iostream>

//  Заалтан хувьсагч (функцын параметер нь заалт байна) хоёр хувьсагчийн утгыг солих хэрэглэгчийн функц бич.


using namespace std;

void swap(int &a, int &b){ // Параметр нь заалт байх swap функцыг үүсгэнэ.
    int temp = a; // а-ийн утгыг түр хадгалах temp хувьсагчид оноож өгнө.
    a = b; // Дараа нь b-ийн утгыг а-д хадгална.
    b = temp; // Дараа нь өмнө нь түр утгад хадгалсан а-ийнхаа утгыг b-д хадгалснаар 2 тоог солих үйлдлийг амжилттай гүйцэтгэнэ.

}

int main(){
    int a = 5, b = 10; // a болон b хувьсагчдыг зарлан, утга оноож өгч байна.
    cout << a << " " << b << endl; // 2 хувьсагчийн утгуудын байрыг солихоос өмнө

    swap(a, b); // Байрыг нь солих функцаа дуудан ажилуулж байна.
    cout << a << " " << b; // Хувьсагчуудын байрыг сольсны дараа

    return 0;
}