#include <iostream>
using namespace std;

// Лаб 1)
// 2. Тойргийн радиусыг гараас авч талбайг бодож хэвэл.

int main(){

    int r;
    // Гараас авах радиусыг хадгалах хувьсагчийг зарлаж байна.
    int pi = 3.1415;
    // π тоогийн утгыг зарлаж өгч байна.
    double s;
    // Олсон талбайг хадгалах хувьсагч зарлаж байна.

    cin >> r;
    // Радиусыг гараас авна.

    s = pi * (r * r);
    // Гурвалжингийн талбайг олох A = πr2 томъёогоор талбайг бодож олно.

    cout << "Talbai: " << s;
    // Олсон талбайгаа дэлгэцэнд харуулна.

    return 0;
}