#include <iostream>
using namespace std;

// Лаб 1)
// 3. Тэгш өнцөгтийн талуудыг өгөхөд талбайг буцаадаг хэрэглэгчийн функц бич.

int RectangleArea(int a, int b){
    return (a * b);
    // Өгөгдсөн урт, өргөнийг үржүүлэн тэгш өнцөгтийн талбайг буцааж байна.
}

int main(){
    int a, b;
    // Гараас авч буй тэгш өнцөгтийн талуудыг хадгалах хувьсагчийг зарлана.

    cin >> a >> b;
    // Тэгш өнцөгтийн талуудыг гараас авч байна.

    /* Талуудыг ӨГӨХ гэхэд нь шууд хувьсагчдад утга онооё гэж бодсон ч гараар авахаар шийдэв.*/

    cout << "Talbai: " << RectangleArea(a, b);
    // Дээр бичсэн талбайг буцаадаг хэрэглэгчийн функцаа ашиглан талбайг олон утгыг хэвлэж байна.

    return 0;
}