#include <iostream>
using namespace std;

int main() {
    int n, sum = 0;
    // Гараас авах n, n тоо хүртэлх тоонуудын нийлбэрийг хадгалах хувьсагч зарлана.
    
    cin >> n;
    // n тоог гараас авна.

    for (int i = 1; i <= n; i++) {
        sum = i + sum;
    }
    // 1-ээс эхлэн n тоо хүртэлх тоонуудын нийлбэрийг олно.

    cout << "Niilber: " << sum << endl;
    // Тоонуудын нийлбэрийг хэвлэнэ.

    cout << "Dundaj: " << (double)sum / n;
    // Тоонуудын нийлбэрийг олно. Олохдоо n хүртэлх тоонуудын нийлбэрийг n тоондоо хуваана.

    return 0;
}