#include <iostream>
using namespace std;

// Лаб 1)
// 6. Өгөгдсөн N ширхэг тооны хамгийн их/хамгийн багийг ол.

#include <iostream>
using namespace std;

int main() {
    int n, x, min, max;
    // Хэдэн тоо авах, оруулах тоонууд, хамгийн бага, их тоонуудыг хадгалах хувьсагч зарлаж өгнө.
    
    cin >> n;
    // Хэдэн тоо оруулахаа гараас оруулж өгнө.

    cin >> x;
    // N ширхэг тоог оруулна.
    min = max = x;
    // Хамгийн их болон бага тоог хадгалах хувьсагчид хамгийн эхний тоогоо хадгалж өгнө.

    for (int i = 1; i < n; i++) {
        cin >> x;

        if (x > max)
            max = x;
        // Давталтад харгалзаж буй тоо нь max-аас их байвал тухайн тоог их гэж үзээд max-ийн утгад өгнө.
        if (x < min)
            min = x;
        // Давталтад харгалзаж буй тоо нь min-ээс их байвал тухайн тоог их гэж үзээд min-ийн утгад өгнө.
    }


    cout << "Hamgiin ih: " << max << endl;
    cout << "Hamgiin baga: " << min << endl;
    // Хамгийн их болон бага утгуудыг хэвлэнэ.

    return 0;
}

