#include <iostream>
using namespace std;

// Лаб 1)
// 6. Өгөгдсөн N ширхэг тооны хамгийн их/хамгийн багийг ол.

int main() {
    int n, max, min;
    // Гараас авах n тоо, хамгийн их, бага тоонуудыг хадгалах утгуудыг зарлаж байна.

    cin >> n;
    // Зарласан n хэмжээтэй тоогоо гараас оруулна.

    int arr[n];
    // n ширхэг тоогоо хадгалах хүснэгт зарлана.
    for (int i = 0; i < n; i++) {
        cin >> arr[i];
    }
    // Тухайн хүснэгтдээ гараас утга оруулж байна.

    max = min = arr[0];
    // Хамгийн их, бага тоонуудад хүснэгтийн эхний тоог өгнө.

    for (int i = 1; i < n; i++) {
    // Эхний тоог өгчихсөн учир давталтын тоолуураа 1-ээс эхлүүлж, оруулж өгсөн тоо хүртэл давтана.
        if (arr[i] > max) max = arr[i];
            // Давталтад харгалзаж буй тоо нь max-аас их үед тухайн тоог хамгийн их гэж үзнэ.
            // Их бол max хувьсагчид онооно.

        if (arr[i] < min) min = arr[i];
            // Давталтад харгалзаж буй тоо нь min-ээс бага үед тухайн тоог хамгийн бага гэж үзнэ.
            // Бага бол min хувьсагчид онооно.

    }

    cout << "Hamgiin ih: " << max << endl;
    // Хамгийн их утгыг хэвлэнэ.
    cout << "Hamgiin baga: " << min;
    // Хамгийн бага утгыг хэвлэнэ.
    return 0;
}