#include <iostream>
using namespace std;

// Лаб 1)
// 7. Өгөгдсөн хүснэгтийн тэгш элементүүдийн тоог ол.

int main(){

    int a[] = {2, 0, 0, 2, 1, 1, 2, 9, 11, 29};
    // Өгөгдсөн хүснэгт

    int n = sizeof(a) / sizeof(a[0]);
    // Өгөгдсөн хүснэгтэд хэдэн элемент байгааг олно.

    int even = 0;
    // Тэгш элементүүдийн тоог хадгалах хувьсагч зарлана.

    for(int i = 0; i < n; i++){
    // Хүснэгтийн тоо бүрээр давтана.
        if (a[i] % 2 == 0){
        // Тухайн тоо тэгш эсэхийг шалгана. Үлдэгдэлтэй 2-т хуваахад хариу нь 0 гарч байвал тэгш тоо гэж үзнэ.
            even++;
            // Тэгш тоо олдсон учир тэгш тооны хувьсагчаа нэгээр нэмэгдүүлнэ.
        }
    }


    cout << "Husnegted bui tegsh elementuudiin too: " << even;
    // Хүснэгтэд буй тэгш элементүүдийг тоог хэвлэнэ.

    return 0;

}