#include <iostream>
using namespace std;

// Лаб 1)
// 8. Өгөгдсөн хүснэгтийн арифметик дунджийг олдог хэрэглэгчийн функц бич.

float average(int a[], int size) {
    float sum = 0;
    // Хүснэгтэд байгаа тоонуудын нийлбэрийг хадгалах хувьсагч
    for (int i = 0; i < size; i++) {
        sum += a[i];
    }
    // Хүснэгтэд байгаа тоонуудын нийлбэрийг олох давталт

    return sum / size;
    // Нийлбэрийг нь нийт хэдэн тоо байгаад хуваана.
    // Ингэснээр дундаж утга буцаагдах болно.
}

int main() {
    int a[] = {2, 0, 0, 2, 1, 1, 2, 9, 11, 29};
    // Өгөгдсөн хүснэгт
    int size = sizeof(a) / sizeof(a[0]);
     // Өгөгдсөн хүснэгтэд хэдэн элемент байгааг олно.

    cout << "Ugugdsun husnegtiin dundaj: " << average(a, size);
    // Хэрэглэгчийн функцаа ашиглан дундаж утгыг хэвлэнэ.
    return 0;
}