#include <iostream>

using namespace std;

// Лаб 1)
// 9. Хүснэгтийг өсөх/буурахаар эрэмбэл.

int main() {
    int a[10] = {0, 2, 2, 8, 15, 2, 3, 4, 29, 11};
    int n = 10;

    for (int i = 0; i < n - 1; i++) {
        // n - 1 хүртэл удаа давтаж тухайн хүснэгтийн хамгийн их тоог хамгийн сүүлчийн байрлалд аваачна.
        for (int j = 0; j < n - i - 1; j++) {
            // Давхар давталт нь n - i - 1 удаа ажиллана. Учир нь хамгийн их тоо нь гаднах давталтад хамгийн сүүлчийн байрлалд оччихсон байгаа учир дахин тэр үйлдлийг хийх шаардлагагүй.
            if (a[j] > a[j + 1]) {
                // a[j] -д байгаа утга a[j + 1] -ээс их байвал a[j], a[j + 1] 2-ийн байрыг сольж дарааллыг өөрчилнө.
                int temp = a[j];
                a[j] = a[j + 1];
                a[j + 1] = temp;
            }
        }
    }

    cout << "Usuh: " << endl;
    for (int i = 0; i < n; i++) {
        cout << a[i] << " ";
    }

    cout << endl;


    for (int i = 0; i < n - 1; i++) {
        // n - 1 хүртэл удаа давтаж тухайн хүснэгтийн хамгийн бага тоог хамгийн сүүлчийн байрлалд аваачна.
        for (int j = 0; j < n - i - 1; j++) {
            // Давхар давталт нь n - i - 1 удаа ажиллана. Учир нь хамгийн бага тоо нь гаднах давталтад хамгийн сүүлчийн байрлалд оччихсон байгаа учир дахин тэр үйлдлийг хийх шаардлагагүй.
            if (a[j] < a[j + 1]) {
                // a[j] -д байгаа утга a[j + 1] -ээс бага байвал a[j], a[j + 1] 2-ийн байрыг сольж дарааллыг өөрчилнө.
                int temp = a[j];
                a[j] = a[j + 1];
                a[j + 1] = temp;
            }
        }
    }

    cout << "Buurah: " << endl;
    for (int i = 0; i < n; i++) {
        cout << a[i] << " ";
    }

    return 0;
}